#include"system_struct.h"
//打印链表结点的函数
void printfList(Node* head)
{
    printf("\n-----------------------------------------------------\n");
    printf("--------------【 隐私信息浏览】----------------------\n");

    int i = 0;          /*记录输出时的编号*/
    Node* pMove;       /*移动指针*/
    pMove = head;
    if (head == NULL)  /*判断链表是否为空*/
    {
        printf("\n抱歉，当前系统内并未查询到任何有关你的账号信息\n\n");
    }
    else
    {
        printf("********************************************************************************\n");
        printf("  编号  　  账号位置         账号描述            账号            密码\n");
        while (pMove)
        {
            i++;
            printf("\n  %-5d   %-15s   %-15s   %-15s   %-15s\n", i, pMove->position, pMove->description, pMove->account, pMove->password);
            pMove = pMove->next;
        }
        printf("\n********************************************************************************\n");
        //   printf("--------------------------------------------------------------------------------\n");
    }
    printf("-----------------------------------------------------\n\n");
}